clear
clc
%% 1
fprintf('\n!!!Первое задание:\n');
alpha = 0.05;
H1 = 0;
x1 = [8	7	8   10   10	8	8	9	9];
x2 = [8	9	7	8	5   10	7];
x3 = [5	7	6   10];

fprintf('\nДисперсионный однофакторный анализ (гипотеза о равенстве средних):\n');
DispersionAnalizOneFactor({x1; x2; x3},alpha);
% fprintf('\nЛинейные контрасты 1 и 2:\n');
% LinearContrast({x1;x2},[1 -1],H1,alpha);
% fprintf('\nЛинейные контрасты 1 и 3:\n');
% LinearContrast({x1;x3},[1 -1],H1,alpha);
% fprintf('\nЛинейные контрасты 2 и 3:\n');
% LinearContrast({x2;x3},[1 -1],H1,alpha);

%% 2
fprintf('\n!!!Второе задание:\n');
x = [88.1 92.2 90.1 84.5 91.8 90.9 90.2 84.4 86.1 90.8 90.3 90.7 92.8 87.5 90.4 91.5 85.1 91.2 87.7 85.1];
y = [88.8 91.1 84.2 84.4 92.2 84.6 84.8 89.1 90.1 89.3 85.5 93.3 84.9 87.1 89.5 87.6 84.3 85.3 89.7 89.9];
H1=0;
alpha = 0.05;

fprintf('\nПервый вариант (через бинарное распределение)\n');
KrZnakEq0(x,y,H1,alpha);
fprintf('\nВторой вариант (через нормальный закон)\n');
KrZnakEq1(x,y,H1,alpha);
fprintf('\nТретий вариант (через распределение Фишера)\n');
KrZnakEq2(x,y,H1,alpha);

%% 3
fprintf('\n!!!Третье задание:\n');
x = [88.1 92.2 90.1 84.5 91.8 90.9 90.2 84.4 86.1 90.8 90.3 90.7 92.8 87.5 90.4 91.5 85.1 91.2 87.7 85.1];
y = 88;
H1=1;
alpha = 0.05;

fprintf('\nПервый вариант (через бинарное распределение)\n');
KrZnakEq0(x,y,H1,alpha);
fprintf('\nВторой вариант (через нормальный закон)\n');
KrZnakEq1(x,y,H1,alpha);
fprintf('\nТретий вариант (через распределение Фишера)\n');
KrZnakEq2(x,y,H1,alpha);

%% 4
fprintf('\n!!!Четвёртое задание:\n');
x = [58.1   50.2   51.1   55.1   58.2   56.3   58.1   59.0   57.2	51.2   50.1   58.3   52.1   54.2   49.1];
y = [50   50   55   50   56   50   58   58   54   53   49   52   52   55   57   58   53   51   52   50];
H1 = 0;
alpha=0.05;

fprintf('\nКритерий серий:\n');
ValfVolfoviz_2(x,y,H1,alpha);
fprintf('\nКритерий Вилкинсона:\n');
VilkinsonMannWitny_2(x,y,H1,alpha);

%% 5
fprintf('\n!!!Пятое задание:\n');
x = [88.1 92.2 90.1 84.5 91.8 90.9 90.2 84.4 86.1 90.8 90.3 90.7 92.8 87.5 90.4 91.5 85.1 91.2 87.7 85.1];
y = [88.8 91.1 84.2 84.4 92.2 84.6 84.8 89.1 90.1 89.3 85.5 93.3 84.9 87.1 89.5 87.6 84.3 85.3 89.7 89.9];
H1 = -1;
alpha=0.05;

fprintf('\nКвадратная корреляция:\n');
SquareCorr(x,y,H1,alpha);
fprintf('\nКритерий Спирмена:\n');
Spirman(x,y,H1,alpha);
fprintf('\nКритерий Кендала:\n');
Kendal(x,y,H1,alpha);


